hiperiondev/esp32idf_APRS/main/app_config.c
// ---- serialize ------------------------------------------------------------
static void config_write_json(jw_t *d, const app_config_t *c) {
    fputc('{', d->f);
    jadd_num(d, "cpuFreq", c->cpuFreq);
    jadd_str(d, "myCallsign", c->my_callsign);
    jadd_num(d, "myLAT", c->my_lat);
    jadd_num(d, "myLON", c->my_lon);
    jadd_num(d, "myALT", c->my_alt);
    jadd_num(d, "myPHGPower", c->my_phg_power);
    jadd_num(d, "myPHGGain", c->my_phg_gain);
    jadd_num(d, "myPHGHeight", c->my_phg_height);
    jadd_num(d, "myPHGDir", c->my_phg_dir);
    jadd_str(d, "myPHG", c->my_phg);
    jadd_num(d, "txTimeSlot", c->tx_timeslot);
    jadd_num(d, "csmaPersist", c->csma_persist);
    jadd_bool(d, "syncTime", c->synctime);
    jadd_num(d, "timeZone", c->timeZone);
    jadd_str(d, "ntpHost0", c->ntp_host[0]);
    jadd_str(d, "ntpHost1", c->ntp_host[1]);
    jadd_str(d, "ntpHost2", c->ntp_host[2]);
    jadd_num(d, "ntpResync", c->ntp_resync_sec);
    jadd_num(d, "WiFiMode", c->wifi_mode);
    jadd_num(d, "WiFiPwr", c->wifi_power);
    jadd_num(d, "WiFiAPCH", c->wifi_ap_ch);
    jadd_str(d, "WiFiAP_SSID", c->wifi_ap_ssid);
    jadd_str(d, "WiFiAP_PASS", c->wifi_ap_pass);
    jarr_begin(d, "WiFiSTA");
    for (int i = 0; i < WIFI_STA_NUM; i++) {
        jarr_bool(d, c->wifi_sta[i].enable);
        jarr_str(d, c->wifi_sta[i].wifi_ssid);
        jarr_str(d, c->wifi_sta[i].wifi_pass);
    }
    jarr_end(d);

    jadd_num(d, "fx25Mode", c->fx25_mode);
    jadd_num(d, "afskModem", c->afsk_modem_type);
    jadd_num(d, "rfPreamble", c->preamble);
    jadd_bool(d, "audioModemEn", c->audio_modem_en);
    jadd_bool(d, "audioLPF", c->audio_lpf);
    jadd_num(d, "rfTxBuffers", c->rf_tx_buffers);
    jadd_num(d, "pttMinUnkeyMs", c->ptt_min_unkey_ms);

    jadd_bool(d, "igateEn", c->igate_en);
    jadd_bool(d, "igateBcn", c->igate_bcn);
    jadd_bool(d, "rf2inet", c->rf2inet);
    jadd_bool(d, "inet2rf", c->inet2rf);
    jadd_bool(d, "igatePos2rf", c->igate_loc2rf);
    jadd_bool(d, "igatePos2inet", c->igate_loc2inet);
    jadd_num(d, "rf2inetFilter", c->rf2inetFilter);
    jadd_num(d, "inet2rfFilter", c->inet2rfFilter);
    jadd_num(d, "rf2inetBudlistMode", c->rf2inet_budlist_mode);
    jadd_num(d, "inet2rfBudlistMode", c->inet2rf_budlist_mode);
    jarr_begin(d, "budlist");
    for (int i = 0; i < IGATE_BUDLIST_MAX; i++)
        jarr_str(d, c->budlist[i]);
    jarr_end(d);
    jadd_bool(d, "rf2inetRangeEn", c->rf2inet_range_en);
    jadd_num(d, "rf2inetRangeKm", c->rf2inet_range_km);
    jadd_bool(d, "rf2inetPrefixEn", c->rf2inet_prefix_en);
    jadd_str(d, "rf2inetPrefixes", c->rf2inet_prefixes);
    jadd_bool(d, "inet2rf3rdPartyUnwrapEn", c->inet2rf_3rdparty_unwrap_en);
    jadd_num(d, "igateSSID", c->aprs_ssid);
    jadd_num(d, "igatePort", c->aprs_port);
    jadd_str(d, "igateMycall", c->aprs_mycall);
    jadd_bool(d, "igateUseStation", c->igate_use_station);
    jadd_str(d, "igatePasscode", c->aprs_passcode);
    jadd_str(d, "igateHost", c->aprs_host);
    jadd_str(d, "igateFilter", c->aprs_filter);
    jadd_num(d, "igateLAT", c->igate_lat);
    jadd_num(d, "igateLON", c->igate_lon);
    jadd_num(d, "igateALT", c->igate_alt);
    jadd_num(d, "igateINV", c->igate_interval);
    jadd_str(d, "igateSymbol", c->igate_symbol);
    jadd_str(d, "igateObject", c->igate_object);
    jadd_str(d, "igatePHG", c->igate_phg);
    jadd_num(d, "igatePath", c->igate_path);
    jadd_str(d, "igateComment", c->igate_comment);
    jadd_num(d, "igateSTSIntv", c->igate_sts_interval);
    jadd_str(d, "igateStatus", c->igate_status);
    jadd_bool(d, "igateTimestamp", c->igate_timestamp);
    jadd_bool(d, "igateCompress", c->igate_compress);
    jadd_bool(d, "igatePHGEn", c->igate_phg_enable);
    jadd_bool(d, "igatePHGUseStation", c->igate_phg_use_station);
    jadd_num(d, "igatePHGPower", c->igate_phg_power);
    jadd_num(d, "igatePHGGain", c->igate_phg_gain);
    jadd_num(d, "igatePHGHeight", c->igate_phg_height);
    jadd_num(d, "igatePHGDir", c->igate_phg_dir);

    jadd_bool(d, "digiEn", c->digi_en);
    jadd_bool(d, "digiAuto", c->digi_auto);
    jadd_bool(d, "digiPos2rf", c->digi_loc2rf);
    jadd_bool(d, "digiPos2inet", c->digi_loc2inet);
    jadd_bool(d, "digiTime", c->digi_timestamp);
    jadd_num(d, "digiSSID", c->digi_ssid);
    jadd_str(d, "digiMycall", c->digi_mycall);
    jadd_bool(d, "digiUseStation", c->digi_use_station);
    jadd_num(d, "digiPath", c->digi_path);
    jadd_num(d, "digiDelay", c->digi_delay);
    jadd_num(d, "digiFilter", c->digiFilter);
    jadd_bool(d, "digiBcn", c->digi_bcn);
    jadd_bool(d, "digiCompress", c->digi_compress);
    jadd_num(d, "digiAlt", c->digi_alt);
    jadd_num(d, "digiLAT", c->digi_lat);
    jadd_num(d, "digiLON", c->digi_lon);
    jadd_num(d, "digiINV", c->digi_interval);
    jadd_str(d, "digiSymbol", c->digi_symbol);
    jadd_str(d, "digiPHG", c->digi_phg);
    jadd_str(d, "digiComment", c->digi_comment);
    jadd_num(d, "digiSTSIntv", c->digi_sts_interval);
    jadd_str(d, "digiStatus", c->digi_status);

    jadd_bool(d, "trkEn", c->trk_en);
    jadd_bool(d, "trkPos2rf", c->trk_loc2rf);
    jadd_bool(d, "trkPos2inet", c->trk_loc2inet);
    jadd_bool(d, "trkTime", c->trk_timestamp);
    jadd_num(d, "trkSSID", c->trk_ssid);
    jadd_str(d, "trkMycall", c->trk_mycall);
    jadd_bool(d, "trkUseStation", c->trk_use_station);
    jadd_num(d, "trkPath", c->trk_path);
    jadd_num(d, "trkLAT", c->trk_lat);
    jadd_num(d, "trkLON", c->trk_lon);
    jadd_num(d, "trkALT", c->trk_alt);
    jadd_num(d, "trkINV", c->trk_interval);
    jadd_bool(d, "trkCompress", c->trk_compress);
    jadd_bool(d, "trkOptAlt", c->trk_altitude);
    jadd_bool(d, "trkLog", c->trk_log);
    jadd_bool(d, "trkOptRSSI", c->trk_rssi);
    jadd_str(d, "trkSymbol", c->trk_symbol);
    jadd_str(d, "trkSymbolMove", c->trk_symmove);
    jadd_str(d, "trkSymbolStop", c->trk_symstop);
    jadd_str(d, "trkItem", c->trk_item);
    jadd_str(d, "trkComment", c->trk_comment);
    jadd_num(d, "trkSTSIntv", c->trk_sts_interval);
    jadd_str(d, "trkStatus", c->trk_status);

    jadd_bool(d, "wxEn", c->wx_en);
    jadd_bool(d, "wxTx2rf", c->wx_2rf);
    jadd_bool(d, "wxTx2inet", c->wx_2inet);
    jadd_bool(d, "wxTime", c->wx_timestamp);
    jadd_num(d, "wxSSID", c->wx_ssid);
    jadd_str(d, "wxMycall", c->wx_mycall);
    jadd_bool(d, "wxUseStation", c->wx_use_station);
    jadd_num(d, "wxPath", c->wx_path);
    jadd_num(d, "wxLAT", c->wx_lat);
    jadd_num(d, "wxLON", c->wx_lon);
    jadd_num(d, "wxALT", c->wx_alt);
    jadd_num(d, "wxInv", c->wx_interval);
    jadd_str(d, "wxObject", c->wx_object);
    jadd_str(d, "wxComment", c->wx_comment);
    jarr_begin(d, "wxSenEn");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_bool(d, c->wx_sensor_enable[i]);
    jarr_end(d);
    jarr_begin(d, "wxSenAvg");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_bool(d, c->wx_sensor_avg[i]);
    jarr_end(d);
    // Sensor mappings travel as driver NAMES, not registry positions: a
    // position only means anything within the firmware image that produced it
    // (see the persistence contract in sensors_local.h), so storing the index
    // would re-point all 13 WX fields at different sensors the moment a driver
    // is enabled or disabled in Kconfig. An unmapped field writes "".
    jarr_begin(d, "wxSenCH");
    for (int i = 0; i < WX_SENSOR_NUM; i++)
        jarr_str(d, sensors_local_channel_name(c->wx_sensor_ch[i]));
    jarr_end(d);

