hiperiondev/esp32idf_APRS/main/app_config.c
    // Second, filesystem-wide gate (storage.h): config_mutex() only keeps two
    // config saves apart, while the temp-file + rename sequence below must
    // also not overlap the whole-partition erase the web Storage page can
    // trigger, nor a save being made by another subsystem. Module lock first,
    // this gate second - the order storage.h's contract requires.
    storage_write_lock();

    // config_mutex() is held across this whole function, which is what
    // json_store_open_tmp() asserts before handing back a stream whose stdio
    // buffer is already pinned.
    FILE *f = json_store_open_tmp(CONFIG_TMP_PATH, TAG, config_mutex());
    if (!f) {
        storage_write_unlock();
        xSemaphoreGive(config_mutex());
        return false;
    }

    jw_t w = { .f = f, .obj_comma = false, .arr_comma = false };
    config_write_json(&w, &g_config);

    if (!json_store_commit(f, CONFIG_TMP_PATH, CONFIG_PATH, TAG, "configuration")) {
        storage_write_unlock();
        xSemaphoreGive(config_mutex());
        return false;
    }

    // How close the calling task (normally the httpd task) came to overflowing
    // its stack during this save, so the config.stack_size in web_server.c can
    // be sized from real numbers instead of a guess. Remove once a safe margin
    // is confirmed.
    ESP_LOGI(TAG, "Caller stack high-water mark: %u bytes free", (unsigned)(uxTaskGetStackHighWaterMark(NULL) * sizeof(StackType_t)));
    storage_write_unlock();
    xSemaphoreGive(config_mutex());
    return true;
}

bool app_config_load(void) {
    cJSON *doc = NULL;
    json_store_status_t st = json_store_read(CONFIG_PATH, TAG, "configuration", &doc);

    switch (st) {
        case JSON_STORE_OK:
            break;

        case JSON_STORE_OOM:
            // The file is very probably intact - there was simply no RAM to
            // read it into. Leave it exactly as it is and report the failure,
            // rather than writing defaults over a configuration that a later
            // attempt would have loaded fine.
            return false;

        case JSON_STORE_MISSING:
        case JSON_STORE_EMPTY:
        case JSON_STORE_CORRUPT:
        default:
            // The boot configuration is the one file the device cannot come up
            // without, so anything unusable here is replaced with the factory
            // set and written back immediately. That costs an operator a
            // corrupt config.json they might have wanted to inspect, and buys
            // a station that always boots into a reachable web admin instead
            // of one that needs a serial flash to recover.
            ESP_LOGW(TAG, "%s unusable, writing defaults", CONFIG_PATH);
            app_config_set_defaults(&g_config);
            return app_config_save();
    }

    config_from_json(doc, &g_config);
    cJSON_Delete(doc);
    ESP_LOGI(TAG, "Configuration loaded");
    return true;
}

bool app_config_factory_reset(void) {
    // Web-reachable (/default) at runtime, so it rewrites the whole g_config
    // out from under the beacon/igate/message tasks. Hold the data lock across
    // the wholesale rewrite so no reader can sample a half-reset struct; drop
    // it before the (slow, self-locking) flash save.
    app_config_lock();
    app_config_set_defaults(&g_config);
    app_config_unlock();
    return app_config_save();
}

uint8_t app_config_path_hop_count(uint8_t pathBitmask, const char pathPreset[4][72]) {
    uint8_t hops = 0;
    for (int bit = 0; bit < 4; bit++) {
        if (!(pathBitmask & (1u << bit)) || !pathPreset[bit][0])
            continue;
        hops++; // the alias itself is at least 1 hop
        for (const char *p = pathPreset[bit]; *p; p++)
            if (*p == ',')
                hops++;
    }
    return hops;
}

uint8_t app_config_path_mask_clamp(uint8_t pathBitmask, const char pathPreset[4][72]) {
    if (app_config_path_hop_count(pathBitmask, pathPreset) <= 8)
        return pathBitmask; // within budget already - nothing to drop

    // Over AX.25's 8-via limit once every selected preset's own comma-joined
    // hops are counted (e.g. two 4-hop presets can exceed 8 well before all 4
    // checkboxes are ticked). Keep presets low-bit-first until the budget is
    // used up and drop the rest, instead of silently saving a bitmask that
    // would later be clipped differently (or reach further than intended) at
    // transmit time - see aprs_path_build_suffix(), which enforces the same
    // limit again as a belt-and-suspenders check for a configuration that
    // reached the device without passing through this form.
    uint8_t clamped = 0;
    uint8_t hopsUsed = 0;
    for (int bit = 0; bit < 4; bit++) {
        if (!(pathBitmask & (1u << bit)) || !pathPreset[bit][0])
            continue;

        uint8_t presetHops = 1;
        for (const char *p = pathPreset[bit]; *p; p++)
            if (*p == ',')
                presetHops++;

        if (hopsUsed + presetHops > 8) {
            ESP_LOGW(TAG, "path bitmask 0x%02X exceeds AX.25 8-hop limit, dropping preset %d and beyond", pathBitmask, bit + 1);
            break;
        }
        clamped |= (uint8_t)(1u << bit);
        hopsUsed += presetHops;
    }
    return clamped;
}
